In [1]:
import numpy as np
import pandas as pd

In [2]:
data1 = {"Name":["Dev","Ankit","Dhruv","Ayushi","Helee","Sujal","Vraj","Melony","Darshit","Riya"], 
         "Age":[21,20,18,21,22,23,25,30,22,30], 
         "City":["Vadodara","Surat","Ahmdabad","Surat","Rajkot","Amreli","Vadodara","Surat","Ahmdabad","Rajkot"]}

In [3]:
df = pd.DataFrame(data1)

In [4]:
df

      Name  Age      City
0      Dev   21  Vadodara
1    Ankit   20     Surat
2    Dhruv   18  Ahmdabad
3   Ayushi   21     Surat
4    Helee   22    Rajkot
5    Sujal   23    Amreli
6     Vraj   25  Vadodara
7   Melony   30     Surat
8  Darshit   22  Ahmdabad
9     Riya   30    Rajkot

In [7]:
# what is difference
print(df.iloc[0])
print(df.loc[0])

Name         Dev
Age           21
City    Vadodara
Name: 0, dtype: object
Name         Dev
Age           21
City    Vadodara
Name: 0, dtype: object

In [8]:
#creating dataframe with dict 
pd.DataFrame.from_dict(dict([("A",[1,2,3]),("B",[4,5,6])]))

   A  B
0  1  4
1  2  5
2  3  6

In [9]:
ser = pd.Series([12,56,78,1,2,0,98,78,66])

In [14]:
ser.idxmax()               # find index of maximum value

6

In [15]:
ser.idxmin()               # find index of minimum value

5

In [25]:
# find min and max index from dataframe
df = pd.DataFrame({
    'A': [10, 25, 8, 30, 15],
    'B': [5, 20, 35, 10, 25]
})

In [26]:
print(df.idxmax())                # all data

A    3
B    2
dtype: int64

In [27]:
print(df['A'].idxmax())           # specific column data

3

In [28]:
print(df.idxmax(1))               # row wise max

0    A
1    A
2    B
3    A
4    B
dtype: object

In [29]:
df.axes

[RangeIndex(start=0, stop=5, step=1), Index(['A', 'B'], dtype='object')]

In [30]:
df.values

array([[10,  5],
       [25, 20],
       [ 8, 35],
       [30, 10],
       [15, 25]], dtype=int64)

In [31]:
df.describe(percentiles = [0.25,0.5,0.75,0.95])  # find specific qurtile

               A          B
count   5.000000   5.000000
mean   17.600000  19.000000
std     9.555103  11.937336
min     8.000000   5.000000
25%    10.000000  10.000000
50%    15.000000  20.000000
75%    25.000000  25.000000
95%    29.000000  33.000000
max    30.000000  35.000000

In [36]:
d = {'one' : pd.Series([1,2,3],index = ["a","b","c"]),
     'two' : pd.Series([25,26,25,23],index = ["a","b","c","d"]),
     'three' : pd.Series([11,22,44],index = ["b","c","d"])}

In [37]:
df = pd.DataFrame(d)

In [38]:
df

   one  two  three
a  1.0   25    NaN
b  2.0   26   11.0
c  3.0   25   22.0
d  NaN   23   44.0

In [39]:
df.sum()                    # gives sum of columns

one       6.0
two      99.0
three    77.0
dtype: float64

In [40]:
df.sum(skipna = False)     # give NaN where NaN value is present (By default True)

one       NaN
two      99.0
three     NaN
dtype: float64

In [41]:
df.sum(1)                   # give row wise sum

a    26.0
b    39.0
c    50.0
d    67.0
dtype: float64

In [42]:
df.sum(1,skipna = False)          # skip NaN values in rows

a     NaN
b    39.0
c    50.0
d     NaN
dtype: float64

In [44]:
df.index.str.upper()                            # to see

Index(['A', 'B', 'C', 'D'], dtype='object')

In [46]:
df.columns.str.title()                          # to see

Index(['One', 'Two', 'Three'], dtype='object')

In [47]:
df

   one  two  three
a  1.0   25    NaN
b  2.0   26   11.0
c  3.0   25   22.0
d  NaN   23   44.0

In [48]:
df = df.rename(index=str.upper, columns=str.title)     # save permanently

# or

df.rename(index=str.upper, columns=str.title,inplace = True)

In [49]:
df

   One  Two  Three
A  1.0   25    NaN
B  2.0   26   11.0
C  3.0   25   22.0
D  NaN   23   44.0

In [51]:
df['div'] = df['Two'] - df['One']

In [52]:
df

   One  Two  Three   div
A  1.0   25    NaN  24.0
B  2.0   26   11.0  24.0
C  3.0   25   22.0  22.0
D  NaN   23   44.0   NaN

In [53]:
column = df["Two"]           # selecting one column for subtraction

In [54]:
column

A    25
B    26
C    25
D    23
Name: Two, dtype: int64

In [56]:
help(df.sub)

Help on method sub in module pandas.core.ops:

sub(other, axis='columns', level=None, fill_value=None) method of pandas.core.frame.DataFrame instance
    Get Subtraction of dataframe and other, element-wise (binary operator `sub`).

    Equivalent to ``dataframe - other``, but with support to substitute a fill_value
    for missing data in one of the inputs. With reverse version, `rsub`.

    Among flexible wrappers (`add`, `sub`, `mul`, `div`, `mod`, `pow`) to
    arithmetic operators: `+`, `-`, `*`, `/`, `//`, `%`, `**`.

    Parameters
    ----------
    other : scalar, sequence, Series, dict or DataFrame
        Any single or multiple element data structure, or list-like object.
    axis : {0 or 'index', 1 or 'columns'}
        Whether to compare by the index (0 or 'index') or columns.
        (1 or 'columns'). For Series input, axis to match Series index on.
    level : int or label
        Broadcast across a level, matching Index values on the
        passed MultiIndex level.
    fill_value : float or None, default None
        Fill existing missing (NaN) values, and any new element needed for
        successful DataFrame alignment, with this value before computation.
        If data in both corresponding DataFrame locations is missing
        the result will be missing.

    Returns
    -------
    DataFrame
        Result of the arithmetic operation.

    See Also
    --------
    DataFrame.add : Add DataFrames.
    DataFrame.sub : Subtract DataFrames.
    DataFrame.mul : Multiply DataFrames.
    DataFrame.div : Divide DataFrames (float division).
    DataFrame.truediv : Divide DataFrames (float division).
    DataFrame.floordiv : Divide DataFrames (integer division).
    DataFrame.mod : Calculate modulo (remainder after division).
    DataFrame.pow : Calculate exponential power.

    Notes
    -----
    Mismatched indices will be unioned together.

    Examples
    --------
    >>> df = pd.DataFrame({'angles': [0, 3, 4],
    ...                    'degrees': [360, 180, 360]},
    ...                   index=['circle', 'triangle', 'rectangle'])
    >>> df
               angles  degrees
    circle          0      360
    triangle        3      180
    rectangle       4      360

    Add a scalar with operator version which return the same
    results.

    >>> df + 1
               angles  degrees
    circle          1      361
    triangle        4      181
    rectangle       5      361

    >>> df.add(1)
               angles  degrees
    circle          1      361
    triangle        4      181
    rectangle       5      361

    Divide by constant with reverse version.

    >>> df.div(10)
               angles  degrees
    circle        0.0     36.0
    triangle      0.3     18.0
    rectangle     0.4     36.0

    >>> df.rdiv(10)
                 angles   degrees
    circle          inf  0.027778
    triangle   3.333333  0.055556
    rectangle  2.500000  0.027778

    Subtract a list and Series by axis with operator version.

    >>> df - [1, 2]
               angles  degrees
    circle         -1      358
    triangle        2      178
    rectangle       3      358

    >>> df.sub([1, 2], axis='columns')
               angles  degrees
    circle         -1      358
    triangle        2      178
    rectangle       3      358

    >>> df.sub(pd.Series([1, 1, 1], index=['circle', 'triangle', 'rectangle']),
    ...        axis='index')
               angles  degrees
    circle         -1      359
    triangle        2      179
    rectangle       3      359

    Multiply a dictionary by axis.

    >>> df.mul({'angles': 0, 'degrees': 2})
                angles      degrees
    circle           0          720
    triangle             0      360
    rectangle            0      720

    >>> df.mul({'circle': 0, 'triangle': 2, 'rectangle': 3}, axis='index')
                angles      degrees
    circle               0        0
    triangle             6      360
    rectangle           12     1080

    Multiply a DataFrame of different shape with operator version.

    >>> other = pd.DataFrame({'angles': [0, 3, 4]},
    ...                      index=['circle', 'triangle', 'rectangle'])
    >>> other
               angles
    circle          0
    triangle        3
    rectangle       4

    >>> df * other
               angles  degrees
    circle          0      NaN
    triangle        9      NaN
    rectangle      16      NaN

    >>> df.mul(other, fill_value=0)
               angles  degrees
    circle          0      0.0
    triangle        9      0.0
    rectangle      16      0.0

    Divide by a MultiIndex by level.

    >>> df_multindex = pd.DataFrame({'angles': [0, 3, 4, 4, 5, 6],
    ...                              'degrees': [360, 180, 360, 360, 540, 720]},
    ...                             index=[['A', 'A', 'A', 'B', 'B', 'B'],
    ...                                    ['circle', 'triangle', 'rectangle',
    ...                                     'square', 'pentagon', 'hexagon']])
    >>> df_multindex
                 angles  degrees
    A circle          0      360
      triangle        3      180
      rectangle       4      360
    B square          4      360
      pentagon        5      540
      hexagon         6      720

    >>> df.div(df_multindex, level=1, fill_value=0)
                 angles  degrees
    A circle        NaN      1.0
      triangle      1.0      1.0
      rectangle     1.0      1.0
    B square        0.0      0.0
      pentagon      0.0      0.0
      hexagon       0.0      0.0

In [59]:
df.sub(column, axis=0)    # axis = 0 (columns wise)

    One  Two  Three  div
A -24.0    0    NaN -1.0
B -24.0    0  -15.0 -2.0
C -22.0    0   -3.0 -3.0
D   NaN    0   21.0  NaN

In [60]:
row = df.iloc[1]             # selecting one row for subtraction

In [61]:
row

One       2.0
Two      26.0
Three    11.0
div      24.0
Name: B, dtype: float64

In [62]:
df.sub(row, axis=1)    # axis = 1 (row wise)

   One  Two  Three  div
A -1.0 -1.0    NaN  0.0
B  0.0  0.0    0.0  0.0
C  1.0 -1.0   11.0 -2.0
D  NaN -3.0   33.0  NaN